/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Invalid value.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "The value “%@” is invalid.";

/* NSFormattingError */
"Err2048-C" = "Formatting error.";

/* NSFileLockingError */
"Err255-C" = "The file could not be locked.";

/* NSFileLockingError */
"Err255-R" = "The file might already be locked, or you might not have appropriate access privileges to lock it.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "The file “%@” could not be locked.";

/* NSFileReadUnknownError */
"Err256" = "The file could not be opened.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "The file “%@” could not be opened.";

/* NSFileReadNoPermissionError */
"Err257" = "The file could not be opened because you do not have appropriate access privileges.";

/* NSFileReadNoPermissionError */
"Err257-C" = "You do not have appropriate access privileges.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "To view or change access privileges, select the item in Finder and choose File > Get Info.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "The file “%@” could not be opened because you do not have appropriate access privileges.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Invalid file name.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "The item could not be opened because the file name “%@” is invalid.";

/* NSFileReadCorruptFileError */
"Err259" = "The file could not be opened because it is not in the right format.";

/* NSFileReadCorruptFileError */
"Err259-C" = "The file is not in the right format.";

/* NSFileReadCorruptFileError */
"Err259-R" = "The file might be corrupted, truncated, or in a different format than you expect.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "The file “%@” could not be opened because it is not in the right format.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "The file does not exist.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "The file “%@” does not exist.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "The file could not be opened using the specified text encoding.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "The specified text encoding is not applicable.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Text encoding %@ is not applicable.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "The file may have been saved using a different text encoding, or it may not be a text file.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "The file could not be opened using text encoding %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "The file “%2$@” could not be opened using text encoding %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "The file could not be opened because the specified URL type is not supported.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "The specified URL type is not supported.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "The file “%1$@” could not be opened because URL type %2$@ is not supported.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "The file could not be opened because URL type %@ is not supported.";

/* NSFileReadTooLargeError */
"Err263" = "The file could not be opened because it is too large.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "The file is too large.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "The file “%@” could not be opened because it is too large.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "The file could not be opened because the text encoding of the contents could not be determined.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "The text encoding of the contents could not be determined.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "It may be possible to open the file by specifying a text encoding explicitly.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "The file “%@” could not be opened because the text encoding of the contents could not be determined.";

/* NSUserCancelledError */
"Err3072-C" = "The operation was cancelled.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "“%@” could not be removed.";

/* NSFileNoSuchFileError */
"Err4-C" = "The file does not exist.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "The file “%@” does not exist.";

/* NSFileWriteUnknownError */
"Err512" = "The file could not be saved.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "“%1$@” could not be copied to “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "“%1$@” could not be linked to “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "“%1$@” could not be moved to “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "“%@” could not be removed.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "The file “%2$@” could not be saved in folder “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "The file “%@” could not be saved.";

/* NSFileWriteNoPermissionError */
"Err513" = "The file could not be saved because you do not have appropriate access privileges.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "“%1$@” could not be copied because you do not have appropriate access privileges for “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "“%1$@” could not be linked because you do not have appropriate access privileges for “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "“%1$@” could not be moved because you do not have appropriate access privileges for “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "“%@” could not be removed because you do not have appropriate access privileges.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "You do not have appropriate access privileges.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "To view or change access privileges, select the item in Finder and choose File > Get Info.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "You do not have appropriate access privileges to save file “%2$@” in folder “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "You do not have appropriate access privileges to save file “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "The item could not be saved because the file name is invalid.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "The item could not be removed because the file name “%@” is invalid.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Invalid file name.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "The item could not be saved because the file name “%@” is invalid.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "The file could not be saved using the specified text encoding.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "The specified text encoding is not applicable.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Text encoding %@ is not applicable.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "If possible, please select another text encoding.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "The file could not be saved using text encoding %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "The file “%2$@” could not be saved using text encoding %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "The file could not be saved because the specified URL type is not supported.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "The specified URL type is not supported.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "The file “%1$@” could not be saved because URL type %2$@ is not supported.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "The file could not be saved because URL type %@ is not supported.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "The file could not be saved because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "“%1$@” could not be copied to “%2$@” because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "“%1$@” could not be linked to “%2$@” because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "“%1$@” could not be moved to “%2$@” because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "There isn’t enough space.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Volume “%@” is out of space.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Remove some files from the volume and try again.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "You cannot save file “%@” because there isn’t enough space.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "You cannot save file “%1$@” because the volume “%2$@” is out of space.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "Operation could not be completed. (%1$@ error %2$ld.)";

